const jsonFileUrl = './items.json';
const itemsWrapper = document.querySelector('.items__wrapper');
const itemsServices = document.querySelector('.items__services');

async function fetchDataAndRender() {
  try {
    const response = await fetch('./items.json');
    if (!response.ok) {
      throw new Error('Ошибка при загрузке данных');
    }
    const json = await response.json();

    renderItems(json);
  } catch (error) {
    console.error(error);
  }
}

function renderItems(data) {
  data.forEach((obj) => {
    render(obj.imageSrc, obj.title, obj.address, obj.services, obj.price, obj.term);
  });
}

function render(imageSrc, title, address, services, price, term) {
  const item = document.createElement('div');
  item.classList.add('items__item');
  item.innerHTML = `
    <div class="items__image">
      <img src="${imageSrc}" alt='Картинка' />
    </div>
    <div class="items__info">
      <div class="items__left">
        <div class="items__naming">${title}</div>
        <div class="items__address">
          <svg class="items__address-location" viewBox="0 0 32 32">
            <path d="M27,12A11,11,0,0,0,5,12C5,22,16,31,16,31S27,22,27,12Z" />
            <circle cx="16" cy="12" r="5" />
          </svg>
          <p>${address}</p>
        </div>
        <div class="items__reviews">
          <div class="items__reviews-grade">9,9</div>
          <div class="items__reviews-total">78 отзывов</div>
        </div>
        <div class="items__services">
        </div>
      </div>
      <div class="items__right">
        <div class="items__price">${price} ₽</div>
        <div class="items__term">за ${term.night} ночь, за ${term.human} чел.</div>
        <button class="items__button">Подробнее</button>
      </div>
    </div>
  `;

  renderServices(item.querySelector('.items__services'), services);

  itemsWrapper.insertAdjacentElement('afterbegin', item);
}

function renderServices(container, services) {
  const servicesList = {
    parking: `
		<div class="items__services-item">
			<svg class="items__services-item-icon" viewBox="0 0 512 512">
				<path d="M499.99 176h-59.87l-16.64-41.6C406.38 91.63 365.57 64 319.5 64h-127c-46.06 0-86.88 27.63-103.99 70.4L71.87 176H12.01C4.2 176-1.53 183.34.37 190.91l6 24C7.7 220.25 12.5 224 18.01 224h20.07C24.65 235.73 16 252.78 16 272v48c0 16.12 6.16 30.67 16 41.93V416c0 17.67 14.33 32 32 32h32c17.67 0 32-14.33 32-32v-32h256v32c0 17.67 14.33 32 32 32h32c17.67 0 32-14.33 32-32v-54.07c9.84-11.25 16-25.8 16-41.93v-48c0-19.22-8.65-36.27-22.07-48H494c5.51 0 10.31-3.75 11.64-9.09l6-24c1.89-7.57-3.84-14.91-11.65-14.91zm-352.06-17.83c7.29-18.22 24.94-30.17 44.57-30.17h127c19.63 0 37.28 11.95 44.57 30.17L384 208H128l19.93-49.83zM96 319.8c-19.2 0-32-12.76-32-31.9S76.8 256 96 256s48 28.71 48 47.85-28.8 15.95-48 15.95zm320 0c-19.2 0-48 3.19-48-15.95S396.8 256 416 256s32 12.76 32 31.9-12.8 31.9-32 31.9z" />
			</svg>
			Автостоянка
		</div>
	`,
    breakfast: `
			<div class="items__services-item">
				<svg class="items__services-item-icon" viewBox="0 0 256 256">
					<path d="M212,32V224a8,8,0,0,1-16,0V168H148a8.2,8.2,0,0,1-6-2.7,8.1,8.1,0,0,1-2-6.2,412.8,412.8,0,0,1,11.8-59.3c12-42.4,28.7-67.8,49.5-75.3A7.9,7.9,0,0,1,212,32ZM127.9,78.7l-8-48a8,8,0,1,0-15.8,2.6L110.6,72H92V32a8,8,0,0,0-16,0V72H57.4l6.5-38.7a8,8,0,1,0-15.8-2.6l-8,48h0A4.9,4.9,0,0,0,40,80a44.1,44.1,0,0,0,36,43.3V224a8,8,0,0,0,16,0V123.3A44.1,44.1,0,0,0,128,80a4.9,4.9,0,0,0-.1-1.2Z" />
				</svg>
				Завтрак
			</div>
		`,
    wifi: `
				<div class="items__services-item">
					<svg class="items__services-item-icon" viewBox="0 0 96 96">
						<path d="M48,60A12,12,0,1,0,60,72,12.0081,12.0081,0,0,0,48,60Z" />
						<path d="M22.6055,46.6289A5.9994,5.9994,0,1,0,31.1133,55.09a24.2258,24.2258,0,0,1,33.7734,0,5.9512,5.9512,0,0,0,4.2539,1.77,6,6,0,0,0,4.2539-10.23C59.7773,32.918,36.2227,32.918,22.6055,46.6289Z" />
						<path d="M90.27,29.7773a59.1412,59.1412,0,0,0-84.539,0,5.9994,5.9994,0,1,0,8.5312,8.4375c18.1172-18.3281,49.3594-18.3281,67.4766,0A5.9994,5.9994,0,1,0,90.27,29.7773Z" />
					</svg>
					Wi-Fi
				</div>
			`,
    playground: `
					<div class="items__services-item">
						<svg class="items__services-item-icon" viewBox="0 0 24 24">
							<path d="M17.3948786,12.3627522 C17.5964451,12.7785697 17.774334,13.2547489 17.9415023,13.7955131 C18.319709,15.0189545 18.3816793,15.2030381 18.611627,15.7002225 C18.7906143,16.087222 18.9957356,16.4363563 19.2403889,16.7586187 C19.720834,16.1685794 20,15.5621533 20,15 L22,15 C22,18.4747237 16.8174565,22 12,22 C7.18254348,22 2,18.4747237 2,15 L4,15 C4,15.4440579 4.17419355,15.915741 4.4841906,16.3851505 L5.92033087,12.0767297 L5.5527864,11.3416408 L3.80254695,12.2167605 L1.78323949,10.197453 L4,5.76393202 L4,3.7801961 L5.19611614,4.01941932 C8.94130605,4.76845731 11,6.41541247 11,9 C11,9.44771525 11.5522847,10 12,10 L13,10 C14.3967113,10 15.382722,10.2360728 16.1221599,10.7617164 C18.2493055,9.62509833 20.4435398,9.76050944 22.5547002,11.1679497 L21.4452998,12.8320503 C20.0638607,11.9110909 18.7525081,11.7546582 17.3948786,12.3627522 Z M6.0634738,17.9718563 C6.26697366,18.1217746 6.48188363,18.2670326 6.7064992,18.4063027 C8.06781864,15.9555793 9.23042124,15 11.5,15 C14.0216318,15 16.1747826,16.5483407 16.8100463,18.6884582 C17.1426293,18.5058926 17.4584855,18.3097494 17.7529238,18.1036821 C17.3711296,17.6253011 17.0590336,17.1076924 16.796373,16.5397775 C16.5128475,15.9267496 16.4407416,15.7125578 16.0307199,14.3861999 C15.4271852,12.4338565 14.9866175,12 13,12 L12,12 C10.4477153,12 9,10.5522847 9,9 C9,7.79234637 8.07208951,6.87275466 5.98508753,6.26589292 L4.23606798,9.76393202 L6.4472136,8.65835921 L8.07966913,11.9232703 L6.0634738,17.9718563 Z M8.49810827,19.2990725 C9.60890953,19.7325636 10.8195983,20 12,20 C12.9877073,20 13.9966203,19.8127519 14.9504747,19.4976515 C14.6721387,18.0987754 13.2523691,17 11.5,17 C10.1985325,17 9.48024766,17.552581 8.49810827,19.2990725 Z" fill-rule="evenodd" />
						</svg>
						Детская площадка
					</div>
				`,
    pool: `
						<div class="items__services-item">
							<svg class="items__services-item-icon" viewBox="0 0 24 24">
								<path d="M18,18V5a3,3,0,0,0-3-3,3,3,0,0,0-3,3V6h2V5a1,1,0,0,1,1-1,1,1,0,0,1,.71.31A1,1,0,0,1,16,5V7H8V5a2.92,2.92,0,0,0-.87-2.11A2.94,2.94,0,0,0,5,2,3,3,0,0,0,2,5V6H4V5A1,1,0,0,1,5,4a1,1,0,0,1,.71.31A1,1,0,0,1,6,5V20H6c-.56,0-.8-.22-1.29-.71A3.56,3.56,0,0,0,2,18v2c.56,0,.8.22,1.29.71A3.56,3.56,0,0,0,6,22,3.56,3.56,0,0,0,8.7,20.71c.49-.49.73-.71,1.29-.71s.8.22,1.29.71a3.48,3.48,0,0,0,5.42,0c.49-.49.73-.71,1.3-.71s.8.22,1.29.71A3.57,3.57,0,0,0,22,22V20c-.56,0-.8-.22-1.29-.71A3.57,3.57,0,0,0,18,18Zm-2-3H8V13h8Zm0-6v2H8V9ZM14,20c-.56,0-.8-.22-1.29-.71A3.56,3.56,0,0,0,10,18a3.2,3.2,0,0,0-2,.65V17h8v1.65a6.48,6.48,0,0,0-.71.64C14.79,19.78,14.55,20,14,20Z" />
							</svg>
							Бассейн
						</div>
					`,
  };

	const body = document.querySelector('body');
	body.insertAdjacentHTML("afterbegin", `
	
	`)

  const servicesHTML = services.map((item) => servicesList[item]).join('');
  container.innerHTML = servicesHTML;
}

// Вызываем функцию загрузки данных при загрузке страницы
fetchDataAndRender();
